Revit 2026 API

# LayerCategoryType Enumeration

---

An enumerated type listing category types supported in an ExportLayerTable.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LayerCategoryType
```
```vb
Public Enumeration LayerCategoryType
```
```cpp
public enum class LayerCategoryType
```
```fsharp
type LayerCategoryType
```

| Member name | Value | Description |
| --- | --- | --- |
| AnalyticalModel | 2 | AnalyticalModel categories. |
| Annotation | 1 | Annotation categories. |
| Imported | 3 | Imported categories. |
| Model | 0 | Model categories. |
| Modifier | 4 | A special value related to modifiers. |
| Unsorted | -1 | A default unsorted type. |

#### Reference

Autodesk.Revit.DB Namespace